---
kind: method
id: M:Autodesk.Revit.DB.UpdaterData.GetDocument
source: html/cb58fbb1-e923-b2f3-8b74-9aac45ad2d0f.htm
---
# Autodesk.Revit.DB.UpdaterData.GetDocument Method

Returns document associated with this UpdaterData

## Syntax (C#)
```csharp
public Document GetDocument()
```